trade_exp/src/Documents/ПорчаТоваров/ПорчаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПорчаТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПриходоватьТоварыПоСебестоимостиСписания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаПорчи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПересчетТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентУценки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f2b90162-0de9-4ba3-8191-3343ac456458">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1de82408-fd44-4902-a127-615efb15ec61">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПодНазначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a93462a1-6dbb-448f-838d-9341e6b16bc0">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="b61f9554-9e2a-4b02-9b30-30effaa6a205">
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="12f17b4e-49b6-4c83-8443-9424e7ac6b1a">
      <name>АналитикаУчетаНоменклатурыОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ИсточникиИнформацииОЦенахДляПечати/ИсточникиИнформацииОЦенахДляПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ИсточникиИнформацииОЦенахДляПечати</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПоСебестоимости</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоВидуЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыУстановокЦенНоменклатуры/СтатусыУстановокЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыУстановокЦенНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="2359daef-54f6-41d6-a6b7-2309f5a549aa">
    <name>НеСогласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="018626f4-2658-4167-b712-36dd4a6d01f1">
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/УстановкаЦенНоменклатуры/УстановкаЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>УстановкаЦенНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a575d058-83a9-4893-9edf-035c813cb60a">
    <name>ВидУстановкиЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88f7890e-bbc2-44ac-a623-6b1825a17288">
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="62b9cc21-3213-4405-b8c6-5e794b0b31ce">
    <name>Розница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01691f4a-ae3f-4d51-99d3-a708baa89cfd">
    <name>МаркетинговоеМероприятие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="fa358103-b0d9-4936-b18c-99a353b041d9">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9d03fe16-0be3-43c0-946b-4e518d310a23">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ff0ea207-c671-491f-ae54-70acb98fd490">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3a16cd1d-5538-4673-9141-bdaac6d463af">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2beacb5e-cd3f-441c-9b57-c6700bc34ecf">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b26742d4-3bd7-4276-8db3-be7ea70331e1">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a7510ab-4cdc-44de-8252-b3936df3e180">
      <name>ЦенаИзмененаВручную</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8b658189-61c4-4c05-9528-ba03c43a6384">
    <name>ВидыЦен</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d4c488cb-175a-4ec5-aece-839bc4f77895">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b340e624-7285-4e80-a0ca-3cf765cb6897">
      <name>НастройкиКомпоновкиДанных</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="36784537-6f16-4267-9caa-cf8cccd60cf0">
    <name>НаборыЗначенийДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="83cba102-e218-4d22-a698-19184b4a483d">
      <name>НомерНабора</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>4</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eae72169-64d6-48fe-9ab2-f0fdd77b4ab9">
      <name>ЗначениеДоступа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7b4bc5fe-61ea-4796-a5f0-86f838171238">
      <name>Уточнение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b830856a-c0f5-4ff2-867e-96417b1a0708">
      <name>Чтение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f8b67b6a-3241-43a6-a903-86207a16b95d">
      <name>Изменение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="feb4f9c3-9a68-45ce-966f-b4aa519afdf2">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a8298318-458a-4781-8cc8-a5ff40c4986a">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aa2f367a-82d3-4c6f-a504-df31ea0941e3">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6dd9084e-7d7d-48ae-b21a-3ad6213cd989">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ПорчаТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПодстановкаДанных()
	
   Если ЗначениеЗаполнено(Объект.Склад) Тогда 
   	
    	Объект.Подразделение = Объект.Склад.Подразделение;
    	Объект.АналитикаРасходов = Объект.Склад.Подразделение;
    	
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура СКПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.ИсключитьИзКонтроля.Доступность= РольДоступна("РазрешитьИсключатьДокументыИзКонтроляОрдерногоУчета");

	ЭтаФорма.Элементы._ГруппаСекции.Видимость=рольДоступна("ПолныеПрава") или рольДоступна("СнятьЗеленение");
    НастройкаОтображенияКомандыСозданияОрдеров();
	
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар"));
	НовыйМассив.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара"));
	НовыеЗначения = Новый ФиксированныйМассив(НовыйМассив);

	НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипНоменклатуры", НовыеЗначения);

	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);

	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);

	Элементы.ТоварыНоменклатураОприходование.ПараметрыВыбора = НовыеПараметры;
	
	Если Объект.ИсточникИнформацииОЦенахДляПечати.Пустая() Тогда
		Объект.ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоВидуЦен;
		Объект.Подразделение = Неопределено;
	КонецЕсли; 

	Если Объект.Ссылка.ПроцентУценки = 0 Тогда
		Объект.ПроцентУценки = 40;
	КонецЕсли; 
	
			
КонецПроцедуры


&После("ПриходоватьТоварыПоСебестоимостиСписанияПриИзмененииСервер")
Процедура Док_ПриходоватьТоварыПоСебестоимостиСписанияПриИзмененииСервер()
	
	ПриходоватьТоварыПоСебестоимостиСписания = Объект.ПриходоватьТоварыПоСебестоимостиСписания ;
	
	//*Альтерра
	Элементы.АналитикаРасходов.Доступность = Не ПриходоватьТоварыПоСебестоимостиСписания или Объект.ПроцентУценки<>0;
	Элементы.СтатьяРасходов.Доступность    = Не ПриходоватьТоварыПоСебестоимостиСписания или Объект.ПроцентУценки<>0;
	Элементы.ЗаполнитьЦены.Доступность = Не ПриходоватьТоварыПоСебестоимостиСписания или Объект.ПроцентУценки<>0;
	//-		
КонецПроцедуры


&НаКлиенте
&ИзменениеИКонтроль("ЗаполнитьЦеныПоВидуЦен")
Процедура Док_ЗаполнитьЦеныПоВидуЦен(Команда) 
	
	ОчиститьСообщения();	
	
	Если Объект.Товары.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='В документе не заполнена таблица ""Товары"". Цены не могут быть заполнены'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Товары", "Объект");
		Возврат;
	КонецЕсли;
	
	#Удаление
	ВидЦены = ЦенообразованиеВызовСервера.ВидЦеныПрайсЛист();
	
	Если ЗначениеЗаполнено(Объект.ВидЦены)
		Или ВидЦены <> Неопределено Тогда
		
		ВидЦены = ?(ЗначениеЗаполнено(Объект.ВидЦены), Объект.ВидЦены, ВидЦены);
		ЦеныРассчитаны = ЗаполнитьЦеныПоВидуЦенСервер(ВидЦены);
		
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, ВидЦены);	
	#КонецУдаления   
	
	#Вставка
		Если ЗначениеЗаполнено(Объект.ВидЦены) Тогда
			// Альтерра +
			ЦеныРассчитаны = ЗаполнитьЦеныПоВидуЦен_();
			// Альтерра -    
			
			ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, Объект.ВидЦены);
	#КонецВставки  
		Иначе
			ТекстСообщения = НСтр("ru = 'Не указан вид цены'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ВидЦены", "Объект");
		КонецЕсли;
		
КонецПроцедуры

&НаКлиенте 
&ИзменениеИКонтроль("ВидЦеныПриИзменении")
Процедура Док_ВидЦеныПриИзменении(Элемент)
	Если Не Объект.ПриходоватьТоварыПоСебестоимостиСписания
		И ЗначениеЗаполнено(Объект.ВидЦены)
		И Объект.Товары.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru = 'Заполнить цены по виду цен ""%ВидЦены%""?'");		
		ТекстВопроса = СтрЗаменить(ТекстВопроса,"%ВидЦены%", Объект.ВидЦены);
		
		#Удаление
		ПоказатьВопрос(Новый ОписаниеОповещения("ВидЦеныПриИзмененииЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		#КонецУдаления
		
		#Вставка
		ПоказатьВопрос(Новый ОписаниеОповещения("Док_ВидЦеныПриИзмененииЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		#КонецВставки
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Док_ВидЦеныПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;
	
	ЦеныРассчитаны = ЗаполнитьЦеныПоВидуЦен_(); 

    ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, Объект.ВидЦены);

КонецПроцедуры   

&НаСервере
Функция ЗаполнитьЦеныПоВидуЦен_()
	Возврат ДопМодульСервер.ПорчаТоваров_ЗаполнитьЦеныПоВидуЦен(Объект);
КонецФункции

&НаКлиенте
Процедура Док_ПроцентУценкиПриИзмененииПосле(Элемент)
	если Объект.ПриходоватьТоварыПоСебестоимостиСписания  тогда
		ПриходоватьТоварыПоСебестоимостиСписанияПриИзмененииСервер();		
	иначе        
		ЦеныРассчитаны = ЗаполнитьЦеныПоВидуЦен_();
	конецесли;
КонецПроцедуры

&НаКлиенте 
&ИзменениеИКонтроль("ТоварыНоменклатураПриИзменении")
Процедура Док_ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.НоменклатураОприходование) Тогда
		ЕстьГрадация = ЕстьГрадацияКачества(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.НоменклатураОприходование);
		Если Не ЕстьГрадация Тогда
			ТекущаяСтрока.НоменклатураОприходование = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			ТекущаяСтрока.ХарактеристикаОприходование = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
			ТекущаяСтрока.ХарактеристикиИспользуютсяОприходование = Ложь;
		КонецЕсли;
	КонецЕсли;
	#Вставка
	ТекСтрокаСтруктура = Новый Структура;
	ТекСтрокаСтруктура.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
	ТекСтрокаСтруктура.Вставить("Характеристика", ТекущаяСтрока.Характеристика);
	ТекСтрокаСтруктура.Вставить("ХарактеристикиИспользуются", ТекущаяСтрока.ХарактеристикиИспользуются);
	ТекСтрокаСтруктура.Вставить("Цена", ТекущаяСтрока.Цена);
	ТекСтрокаСтруктура.Вставить("ВидЦены", Объект.ВидЦены);
	ТекСтрокаСтруктура.Вставить("Упаковка", ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка"));
	ТекСтрокаСтруктура.Вставить("Артикул", ТекущаяСтрока.Артикул);
	#КонецВставки
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	#Удаление
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура, НоменклатураОприходование", "Артикул", "АртикулОприходование"));
	#КонецУдаления
	
	#Вставка
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура, Номенклатура", "Артикул", "Артикул"));
	#КонецВставки
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
	СтруктураДействий.Вставить("ПроверитьЗаполнитьНазначение");
	
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
	ЭтаФорма.ИмяФормы, "Товары"));
	
	#Удаление  
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	#КонецУдаления
	
	#Вставка
	Если Не Объект.ПриходоватьТоварыПоСебестоимостиСписания Тогда
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", Новый Структура("Дата, Валюта",Объект.Дата, ВалютаДокумента));
	КонецЕсли;
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекСтрокаСтруктура, СтруктураДействий, КэшированныеЗначения);
	Если Объект.ПриходоватьТоварыПоСебестоимостиСписания  Тогда
		
		Коэфф=1-Объект.ПроцентУценки/100;
		
		ТекущаяСтрока.Цена = ТекСтрокаСтруктура.Цена*Коэфф;
	КонецЕсли;
	#КонецВставки 
	
КонецПроцедуры

&НаКлиенте  
&ИзменениеИКонтроль("ТоварыНоменклатураОприходованиеПриИзменении")
Процедура Док_ТоварыНоменклатураОприходованиеПриИзменении(Элемент)  
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекущаяСтрока = Новый Структура;
	ТекущаяСтрока.Вставить("Номенклатура", ТекущиеДанные.НоменклатураОприходование);
	ТекущаяСтрока.Вставить("Характеристика", ТекущиеДанные.ХарактеристикаОприходование);
	ТекущаяСтрока.Вставить("ХарактеристикиИспользуются", ТекущиеДанные.ХарактеристикиИспользуютсяОприходование);
    #Удаление
    ТекущаяСтрока.Вставить("Цена", ТекущиеДанные.Цена);
	ТекущаяСтрока.Вставить("ВидЦены", Объект.ВидЦены);
    #КонецУдаления
	ТекущаяСтрока.Вставить("Упаковка", ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка"));
	ТекущаяСтрока.Вставить("Артикул", ТекущиеДанные.Артикул);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущиеДанные.ХарактеристикаОприходование);
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));

    #Удаление
    Если Не Объект.ПриходоватьТоварыПоСебестоимостиСписания Тогда
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", Новый Структура("Дата, Валюта", Объект.Дата, Объект.Валюта));
	КонецЕсли;
    #КонецУдаления
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

	ТекущиеДанные.ХарактеристикаОприходование = ТекущаяСтрока.Характеристика;
	ТекущиеДанные.ХарактеристикиИспользуютсяОприходование = ТекущаяСтрока.ХарактеристикиИспользуются;
	ТекущиеДанные.АртикулОприходование = ТекущаяСтрока.Артикул;
    #Удаление
    ТекущиеДанные.Цена = ТекущаяСтрока.Цена;
    #КонецУдаления
	
КонецПроцедуры  

&НаКлиенте 
&ИзменениеИКонтроль("ТоварыНоменклатураОприходованиеНачалоВыбора")
Процедура Док_ТоварыНоменклатураОприходованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Выберите строку, для которой Вы хотите изменить качество'"));
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекущаяСтрока = Новый Структура;
	ТекущаяСтрока.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
	ТекущаяСтрока.Вставить("Характеристика", ТекущиеДанные.Характеристика);
	ТекущаяСтрока.Вставить("ХарактеристикиИспользуются", ТекущиеДанные.ХарактеристикиИспользуются);
	ТекущаяСтрока.Вставить("НоменклатураОприходование");
	ТекущаяСтрока.Вставить("ХарактеристикаОприходование");
	ТекущаяСтрока.Вставить("ХарактеристикиИспользуютсяОприходование");
    #Удаление
    ТекущаяСтрока.Вставить("Цена", ТекущиеДанные.Цена);
	ТекущаяСтрока.Вставить("ВидЦены", Объект.ВидЦены);
    #КонецУдаления
	ТекущаяСтрока.Вставить("Упаковка", ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка"));
	ТекущаяСтрока.Вставить("Артикул", ТекущиеДанные.Артикул);
	ТекущаяСтрока.Вставить("АртикулОприходование", ТекущиеДанные.АртикулОприходование);

	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура, НоменклатураИсходногоКачества", "Артикул", "АртикулОприходование"));
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущиеДанные.Характеристика);
	Если ЗначениеЗаполнено(ТекущиеДанные.Характеристика) Тогда
		СтруктураДействий.Вставить("ЗаполнитьХарактеристикуНекачественногоТовара", ТекущиеДанные.Характеристика);
	КонецЕсли;
    #Удаление
    Если Не Объект.ПриходоватьТоварыПоСебестоимостиСписания Тогда
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", Новый Структура("Дата, Валюта", Объект.Дата, Объект.Валюта));
	КонецЕсли;
    #КонецУдаления
	
	Оповещение = Новый ОписаниеОповещения("ТоварыНоменклатураОприходованиеНачалоВыбораЗавершение", 
		ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные));
	СкладыКлиент.ИзменитьКачество(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения, Оповещение);
	
КонецПроцедуры

&НаСервере
Процедура Док_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	ПриходоватьТоварыПоСебестоимостиСписания = Объект.ПриходоватьТоварыПоСебестоимостиСписания ;
	
	Элементы.АналитикаРасходов.Доступность = Не ПриходоватьТоварыПоСебестоимостиСписания или Объект.ПроцентУценки<>0;
	Элементы.СтатьяРасходов.Доступность    = Не ПриходоватьТоварыПоСебестоимостиСписания или Объект.ПроцентУценки<>0;
	Элементы.ЗаполнитьЦены.Доступность = Не ПриходоватьТоварыПоСебестоимостиСписания или Объект.ПроцентУценки<>0;
	
КонецПроцедуры


#Область Зеленение
&НаКлиенте
Процедура СброситьПоСекции(Команда)
	МассивВыдСтрок=Элементы.Товары.ВыделенныеСтроки;
	если МассивВыдСтрок.Количество()<>0 тогда
		Для Каждого ТекСтрока Из МассивВыдСтрок Цикл
			СтрокаКоллекции=Объект.Товары.НайтиПоИдентификатору(ТекСтрока);
			СтрокаКоллекции.Кладовщик="";
		конеццикла;
	конецесли;	
КонецПроцедуры
&НаКлиенте
Процедура СКТоварыПередУдалением(Элемент, Отказ)
		если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) тогда
		Предупреждение("Товар выдан со склада. Удаление строки запрещено!!!");
		Отказ=Истина;
	конецесли;	

КонецПроцедуры
&НаКлиенте
Процедура СКТоварыПередНачаломИзменения(Элемент, Отказ)
		если ЗначениеЗаполнено(Элементы.товары.ТекущиеДанные.Кладовщик) тогда
		Предупреждение("Товар выдан со склада. Удаление строки запрещено!!!");
		Отказ=Истина;
	конецесли;	

КонецПроцедуры

&После("УстановитьУсловноеОформление")
Процедура Спр_УстановитьУсловноеОформление()
	АльтерраОбщегоНазначения.УстановитьОформлениеЗеленениеСтрокТабличныхЧастей(ЭтаФорма,"Товары");
КонецПроцедуры

#КонецОбласти

#Область Доработки_по_ордерной_схеме

&НаСервере
Процедура НастройкаОтображенияКомандыСозданияОрдеров()
	
	ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач = 
	СкладыСервер.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач(Объект.Склад, Объект.Дата); 
	
	Если ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
		ЭтаФорма.Элементы.Форма_СоздатьОрдера.Видимость = ?(ЗначениеЗаполнено(Объект.ПересчетТоваров) Или ЗначениеЗаполнено(Объект.ДокументОснование),Ложь,Истина);
	Иначе
		ЭтаФорма.Элементы.Форма_СоздатьОрдера.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Док__СоздатьОрдераПослеНаСервере()
	Альтерра_СкладСервер.СоздатьОрдераПоАктам(Объект.Ссылка);	
КонецПроцедуры

&НаКлиенте
Процедура Док__СоздатьОрдераПосле(Команда)
	Док__СоздатьОрдераПослеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Док_СкладПриИзмененииПосле(Элемент)
	НастройкаОтображенияКомандыСозданияОрдеров();
	ПодстановкаДанных();	
КонецПроцедуры

&НаКлиенте
Процедура Док_ДатаПриИзмененииПосле(Элемент)
	НастройкаОтображенияКомандыСозданияОрдеров();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗагрузитьИзФайла_Альтерра(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла", ЭтотОбъект);
	ПараметрыФормы= Новый Структура();
	ПараметрыФормы.Вставить("НастройкиТаблицы",СтруктураТаблицы());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Функция СтруктураТаблицы()
	
	СтруктураТаблицы=Новый Структура();
	
	СтруктураТаблицы.Вставить("Код","строка#Код#15#1#Справочники.Номенклатура.НайтиПоКоду(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Номенклатура","СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#Номенклатура");
	СтруктураТаблицы.Вставить("Характеристика","строка#Характеристика#20");
	СтруктураТаблицы.Вставить("Количество","число#Количество#15");
	СтруктураТаблицы.Вставить("Цена","число#Цена#10");

	возврат  СтруктураТаблицы;
КонецФункции 

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла(Результат, ДополнительныеПараметры) Экспорт
	
	ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер(Результат, ДополнительныеПараметры) 
	
	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		
		Если ТаблицаДанных<>Неопределено Тогда
			Объект.Товары.Загрузить(ТаблицаДанных);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Если Параметры.Свойство("Ссылка") Тогда
			СоздатьУстановкуЦен(Параметры.Ссылка);	
		Иначе	
			СоздатьУстановкуЦен(Неопределено);  
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СоздатьУстановкуЦен(Параметр)
	ВидЦены = Объект.Склад.Подразделение.ЦенаЗакупа;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПорчаТоваровТовары.НоменклатураОприходование КАК Номенклатура,
		|	МАКСИМУМ(ПорчаТоваровТовары.Цена) КАК Цена,
		|	&ВидЦены КАК ВидЦены,
		|	ПорчаТоваровТовары.Характеристика КАК Характеристика
		|ИЗ
		|	Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
		|ГДЕ
		|	ПорчаТоваровТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПорчаТоваровТовары.НоменклатураОприходование,
		|	ПорчаТоваровТовары.Характеристика";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Попытка
		Если Параметр = Неопределено Тогда
			ДокументУстановкаЦен = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
			ДокументУстановкаЦен.Дата = ТекущаяДата();
			ДокументУстановкаЦен.Статус = Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован;
			ДокументУстановкаЦен.Согласован = Истина;
			ДокументУстановкаЦен.ВидУстановкиЦен = Перечисления.ВидыУстановкиЦен.Переоценка;
			ДокументУстановкаЦен.ДокументОснование= Объект.Ссылка;
			ДокументУстановкаЦен.Ответственный = Пользователи.ТекущийПользователь();
			НоваяСтрока= ДокументУстановкаЦен.ВидыЦен.Добавить();
			НоваяСтрока.ВидЦены= ВидЦены;
		
			ДокументУстановкаЦен.Товары.Загрузить(ТЗ);
			
	        ДокументУстановкаЦен.Записать(РежимЗаписиДокумента.Проведение);
			АльтерраОбщегоНазначения.СообщитьПользователю(ДокументУстановкаЦен.Ссылка,"Создан документ - " + ДокументУстановкаЦен.Ссылка);
		Иначе
			ДокументУстановкаЦен = Параметр.ПолучитьОбъект();
			ДокументУстановкаЦен.Ответственный = Пользователи.ТекущийПользователь();
			ДокументУстановкаЦен.ВидыЦен.Очистить();
			НоваяСтрока= ДокументУстановкаЦен.ВидыЦен.Добавить();
			НоваяСтрока.ВидЦены= ВидЦены;
		
			ДокументУстановкаЦен.Товары.Загрузить(ТЗ);
			
	        ДокументУстановкаЦен.Записать(РежимЗаписиДокумента.Проведение);
			АльтерраОбщегоНазначения.СообщитьПользователю(ДокументУстановкаЦен.Ссылка,"Изменен документ - " + ДокументУстановкаЦен.Ссылка);	
		КонецЕсли;
	Исключение
		Сообщить("Ошибка при записи документа! " + ИнформацияОбОшибке().Описание);
	КонецПопытки;
       
КонецПроцедуры


&НаСервере
Функция  ПроверитьУстановкаЦен()
	ЗначениеВозврата = Неопределено;
	// Проверка на связанные Установка цен 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УстановкаЦенНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПорчаТоваров КАК ПорчаТоваров
		|		ПО УстановкаЦенНоменклатуры.ДокументОснование = ПорчаТоваров.Ссылка
		|ГДЕ
		|	ПорчаТоваров.Ссылка = &Ссылка
		|	И УстановкаЦенНоменклатуры.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Если  Запрос.Выполнить().Пустой() Тогда
		ЗначениеВозврата = Документы.УстановкаЦенНоменклатуры.ПустаяСсылка();	
	Иначе
		// Проверка были ли изменения в Порче товаров 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
		|		ПО (ПорчаТоваровТовары.Ссылка = УстановкаЦенНоменклатурыТовары.Ссылка.ДокументОснование
		|					И (ПорчаТоваровТовары.НоменклатураОприходование <> УстановкаЦенНоменклатурыТовары.Номенклатура
		|						И ПорчаТоваровТовары.НомерСтроки = УстановкаЦенНоменклатурыТовары.НомерСтроки)
		|				ИЛИ ПорчаТоваровТовары.Ссылка = УстановкаЦенНоменклатурыТовары.Ссылка.ДокументОснование
		|					И (ПорчаТоваровТовары.НоменклатураОприходование = УстановкаЦенНоменклатурыТовары.Номенклатура
		|						И ПорчаТоваровТовары.Цена <> УстановкаЦенНоменклатурыТовары.Цена)
		|				ИЛИ ПорчаТоваровТовары.Ссылка = УстановкаЦенНоменклатурыТовары.Ссылка.ДокументОснование
		|					И ПорчаТоваровТовары.Ссылка.Склад.Подразделение.ЦенаЗакупа <> УстановкаЦенНоменклатурыТовары.ВидЦены
		|				ИЛИ ПорчаТоваровТовары.Ссылка = УстановкаЦенНоменклатурыТовары.Ссылка.ДокументОснование
		|					И ПорчаТоваровТовары.НомерСтроки <> УстановкаЦенНоменклатурыТовары.НомерСтроки)
		|ГДЕ
		|	УстановкаЦенНоменклатурыТовары.Ссылка.ДокументОснование = &ДокументОснование
		|	И УстановкаЦенНоменклатурыТовары.Ссылка.Проведен";
	
		Запрос.УстановитьПараметр("ДокументОснование",Объект.Ссылка);	
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ЗначениеВозврата = РезультатЗапроса.Выгрузить()[0].Ссылка;
		КонецЕсли;	
	КонецЕсли;	
	Возврат  ЗначениеВозврата;
КонецФункции	

&НаКлиенте
Процедура Док_ПослеЗаписиПосле(ПараметрыЗаписи)
	ЗначениеПроверки = ПроверитьУстановкаЦен();
	Если ЗначениеПроверки<>Неопределено Тогда
		Если ЗначениеПроверки = ПредопределенноеЗначение("Документ.УстановкаЦенНоменклатуры.ПустаяСсылка") Тогда 
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтотОбъект,Новый Структура());	
   			ПоказатьВопрос(Оповещение,"Необходимо создать 'Установку цен номенклатуры' нажмите 'ОК' , если нет, то нажмите 'Отмена'",РежимДиалогаВопрос.ОКОтмена,0,КодВозвратаДиалога.ОК);  
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтотОбъект,Новый Структура("Ссылка",ЗначениеПроверки));	
   			ПоказатьВопрос(Оповещение,"Необходимо изменить - "+ЗначениеПроверки+" нажмите 'ОК' , если нет, то нажмите 'Отмена'",РежимДиалогаВопрос.ОКОтмена,0,КодВозвратаДиалога.ОК);  
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
